Repository: LZhenHong/KeyboardLocker
Catalog: KeyboardLocker/i18n/Localizable.xcstrings
Source language: en
Languages: zh_hans

# about.feature.auto.lock
source: Auto lock functionality
zh_hans: 自动锁定功能

# about.feature.lock
source: Quick keyboard lock/unlock
zh_hans: 快速锁定/解锁键盘

# about.feature.notifications
source: System notification alerts
zh_hans: 系统通知提醒

# about.feature.shortcut
source: Global shortcut support
zh_hans: 全局快捷键支持

# about.features
source: Features
zh_hans: 功能特性

# about.github
source: View on GitHub
zh_hans: 在 GitHub 上查看

# about.subtitle
source: App information and version
zh_hans: 应用信息和版本

# about.title
source: About
zh_hans: 关于

# about.version.format
source: Version %@
zh_hans: 版本 %@

# action.lock
source: Lock Keyboard
zh_hans: 锁定键盘

# action.quit
source: Quit
zh_hans: 退出

# action.unlock
source: Unlock Keyboard
zh_hans: 解锁键盘

# app.menu.title
source: Keyboard Locker
zh_hans: 键盘锁

# app.title
source: Keyboard Locker
zh_hans: 键盘锁

# auto.lock.disabled
source: Disabled
zh_hans: 已禁用

# auto.lock.ready.to.lock
source: Ready to lock
zh_hans: 准备锁定

# auto.lock.status
source: Auto-lock: %@
zh_hans: 自动锁定: %@

# countdown.finished
source: Finished
zh_hans: 已完成

# countdown.hours.format
source: %d:%02d:%02d remaining
zh_hans: 剩余 %d:%02d:%02d

# countdown.minutes.format
source: %d:%02d remaining
zh_hans: 剩余 %d:%02d

# countdown.seconds.format
source: %d seconds remaining
zh_hans: 剩余 %d 秒

# duration.hours
source: %d hour(s)
zh_hans: %d小时

# duration.hours.description
source: Auto unlock after %d hours
zh_hans: %d小时后自动解锁

# duration.hours.minutes
source: %d hour(s) %d minute(s)
zh_hans: %d小时%d分钟

# duration.hours.minutes.description
source: Auto unlock after %d hours %d minutes
zh_hans: %d小时%d分钟后自动解锁

# duration.infinite
source: Infinite
zh_hans: 无限期

# duration.infinite.description
source: Lock indefinitely
zh_hans: 无限期锁定

# duration.minutes
source: %d minute(s)
zh_hans: %d分钟

# duration.minutes.description
source: Auto unlock after %d minutes
zh_hans: %d分钟后自动解锁

# duration.never
source: Never
zh_hans: 从不

# duration.never.description
source: Never auto unlock
zh_hans: 永不自动解锁

# lock.duration.format
source: Locked for %@
zh_hans: 已锁定 %@

# notification.error
source: Error
zh_hans: 错误

# notification.keyboard.locked
source: Keyboard Locked
zh_hans: 键盘已锁定

# notification.keyboard.unlocked
source: Keyboard Unlocked
zh_hans: 键盘已解锁

# notification.locked.message
source: Use ⌘+⌥+L to unlock keyboard
zh_hans: 使用 ⌘+⌥+L 解锁键盘

# notification.unlocked.message
source: Keyboard input restored to normal
zh_hans: 键盘输入已恢复正常

# notification.url.command
source: URL Command
zh_hans: URL 命令

# open.system.preferences
source: Open System Settings
zh_hans: 打开系统设置

# permission.description
source: Keyboard Locker needs accessibility permission to control your keyboard. This allows the app to temporarily block keyboard input when activated.
zh_hans: Keyboard Locker 需要辅助功能权限来控制您的键盘。这允许应用程序在激活时暂时阻止键盘输入。

source: Permission Required
zh_hans: 需要权限

source: Quick Actions
zh_hans: 快速操作

# settings.auto.lock
source: Auto Lock
zh_hans: 自动锁定

# settings.auto.lock.description
source: Set the time to automatically lock keyboard after inactivity
zh_hans: 设置无操作后自动锁定键盘的时间

# settings.keyboard
source: Keyboard
zh_hans: 快捷键

# settings.keyboard.description
source: Use shortcut to quickly lock/unlock keyboard
zh_hans: 使用快捷键快速锁定或解锁键盘

# settings.notifications
source: Notifications
zh_hans: 通知

# settings.notifications.description
source: Display system notifications when locking and unlocking
zh_hans: 锁定和解锁时显示系统通知

# settings.reset
source: Reset Settings
zh_hans: 重置设置

# settings.show.notifications
source: Show Lock Notifications
zh_hans: 显示锁定通知

# settings.subtitle
source: Configure app preferences
zh_hans: 配置应用偏好设置

# settings.title
source: Settings
zh_hans: 设置

# shortcut.hint
source: Shortcut: ⌘+⌥+L
zh_hans: 快捷键: ⌘+⌥+L

# status.locked
source: Keyboard Locked
zh_hans: 键盘已锁定

# status.unlocked
source: Keyboard Unlocked
zh_hans: 键盘未锁定

# time.activity.text
source: Starts counting when you stop typing or using the mouse
zh_hans: 当您停止输入或使用鼠标时开始计时

# time.auto.lock.duration
source: Auto-lock Duration
zh_hans: 自动锁定时长

# time.minutes
source: Minutes
zh_hans: 分钟

# timed.lock.custom
source: Custom Duration
zh_hans: 自定义时长

# timed.lock.remaining
source: Remaining time: %@
zh_hans: 剩余时间：%@

# timed.lock.start
source: Start
zh_hans: 开始

# timed.lock.title
source: Timed Lock
zh_hans: 定时锁定

# url.error.invalid.scheme
source: Invalid URL scheme. Expected 'keyboardlocker'
zh_hans: 无效的 URL 协议。期望 'keyboardlocker'

# url.error.manager.unavailable
source: Keyboard lock manager not available
zh_hans: 键盘锁定管理器不可用

# url.error.missing.command
source: Missing command in URL
zh_hans: URL 中缺少命令

# url.error.unknown.command
source: Unknown command: %@. Supported commands: %@
zh_hans: 未知命令：%@。支持的命令：%@

# url.response.lock.failed
source: Failed to lock keyboard. Please check accessibility permissions.
zh_hans: 锁定键盘失败。请检查辅助功能权限。

# url.response.unlock.failed
source: Failed to unlock keyboard
zh_hans: 解锁键盘失败
